MikroElektronika/SDK-Build-Tool/sdk/targets/arm/mikroe/ai_generated/stm32/src/uart/implementations/doc_ds_91/hal_ll_uart.c
        #if defined(UART_MODULE_11) && defined(UART11_NVIC)
        case hal_ll_uart_module_num(UART_MODULE_11):
            hal_ll_core_enable_irq( UART11_NVIC );
            break;
        #endif

        #if defined(UART_MODULE_12) && defined(UART12_NVIC)
        case hal_ll_uart_module_num(UART_MODULE_12):
            hal_ll_core_enable_irq( UART12_NVIC );
            break;
        #endif


        default:
            break;
    }
}

void hal_ll_uart_irq_disable( handle_t *handle, hal_ll_uart_irq_t irq )
{
    low_level_handle = hal_ll_uart_get_handle;
    hal_ll_uart_hw_specifics_map_local = hal_ll_get_specifics(hal_ll_uart_get_module_state_address);

    hal_ll_uart_base_handle_t *hal_ll_hw_reg = ( hal_ll_uart_base_handle_t *)hal_ll_uart_hw_specifics_map_local->base;

    switch ( irq ) {
        case HAL_LL_UART_IRQ_RX:
            __HAL_LL_UART_DISABLE_IT( hal_ll_hw_reg, HAL_LL_UART_IT_RXNE );
            break;

        case HAL_LL_UART_IRQ_TX:
            __HAL_LL_UART_DISABLE_IT( hal_ll_hw_reg, HAL_LL_UART_IT_TXE );
            break;

        default:
            break;
    }

    // Check if module interrupt flags are set or not
    if ( ( !check_reg_bit( &hal_ll_hw_reg->cr1, HAL_LL_UART_SR_RXNE ) ) &&
         ( !check_reg_bit( &hal_ll_hw_reg->cr1, HAL_LL_UART_SR_TXE ) ) )
    {
        switch ( hal_ll_uart_hw_specifics_map_local->module_index )
        {
            #if defined(UART_MODULE_1) && defined(UART1_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_1):
                hal_ll_core_disable_irq( UART1_NVIC );
                break;
            #endif

            #if defined(UART_MODULE_2) && defined(UART2_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_2):
                hal_ll_core_disable_irq( UART2_NVIC );
                break;
            #endif

            #if defined(UART_MODULE_3) && defined(UART3_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_3):
                hal_ll_core_disable_irq( UART3_NVIC );
                break;
            #endif

            #if defined(UART_MODULE_4) && defined(UART4_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_4):
                hal_ll_core_disable_irq( UART4_NVIC );
                break;
            #endif

            #if defined(UART_MODULE_5) && defined(UART5_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_5):
                hal_ll_core_disable_irq( UART5_NVIC );
                break;
            #endif

            #if defined(UART_MODULE_6) && defined(UART6_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_6):
                hal_ll_core_disable_irq( UART6_NVIC );
                break;
            #endif

            #if defined(UART_MODULE_7) && defined(UART7_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_7):
                hal_ll_core_disable_irq( UART7_NVIC );
                break;
            #endif

            #if defined(UART_MODULE_8) && defined(UART8_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_8):
                hal_ll_core_disable_irq( UART8_NVIC );
                break;
            #endif

            #if defined(UART_MODULE_9) && defined(UART9_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_9):
                hal_ll_core_disable_irq( UART9_NVIC );
                break;
            #endif

            #if defined(UART_MODULE_10) && defined(UART10_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_10):
                hal_ll_core_disable_irq( UART10_NVIC );
                break;
            #endif

            #if defined(UART_MODULE_11) && defined(UART11_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_11):
                hal_ll_core_disable_irq( UART11_NVIC );
                break;
            #endif

            #if defined(UART_MODULE_12) && defined(UART12_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_12):
                hal_ll_core_disable_irq( UART12_NVIC );
                break;
            #endif


            default:
                break;
        }
    }
}

void hal_ll_uart_write( handle_t *handle, uint8_t wr_data) {
    hal_ll_uart_hw_specifics_map_local = hal_ll_get_specifics(hal_ll_uart_get_module_state_address);
    hal_ll_uart_base_handle_t *hal_ll_hw_reg = ( hal_ll_uart_base_handle_t *)hal_ll_uart_hw_specifics_map_local->base;

    hal_ll_hw_reg->tdr = wr_data;
}

uint8_t hal_ll_uart_read( handle_t *handle ) {
    hal_ll_uart_hw_specifics_map_local = hal_ll_get_specifics(hal_ll_uart_get_module_state_address);
    hal_ll_uart_base_handle_t *hal_ll_hw_reg = ( hal_ll_uart_base_handle_t *)hal_ll_uart_hw_specifics_map_local->base;

    return ( hal_ll_hw_reg->rdr );
}

// ------------------------------------------------------------- DEFAULT EXCEPTION HANDLERS

#if defined(USART_MODULE_1)
void MARK_AS_IRQ_HANDLER UART1_IRQHandler() MIKROC_IV(UART1_NVIC) {
    #ifdef USART_MODULE_1
    if( hal_ll_uart_get_status_flags( HAL_LL_USART1_BASE_ADDRESS , HAL_LL_UART_STATUS_RXNE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_USART1_BASE_ADDRESS, HAL_LL_UART_IT_RXNE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_USART1_BASE_ADDRESS, HAL_LL_UART_STATUS_RXNE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(USART_MODULE_1) ], HAL_LL_UART_IRQ_RX );
        }
    }
    if( hal_ll_uart_get_status_flags( HAL_LL_USART1_BASE_ADDRESS , HAL_LL_UART_STATUS_TXE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_USART1_BASE_ADDRESS, HAL_LL_UART_IT_TXE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_USART1_BASE_ADDRESS, HAL_LL_UART_STATUS_TXE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(USART_MODULE_1) ], HAL_LL_UART_IRQ_TX );
        }
    }
    #endif
}
#endif

#if defined(USART_MODULE_2)
void MARK_AS_IRQ_HANDLER UART2_IRQHandler() MIKROC_IV(UART2_NVIC) {
    #ifdef USART_MODULE_2
    if( hal_ll_uart_get_status_flags( HAL_LL_USART2_BASE_ADDRESS , HAL_LL_UART_STATUS_RXNE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_USART2_BASE_ADDRESS, HAL_LL_UART_IT_RXNE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_USART2_BASE_ADDRESS, HAL_LL_UART_STATUS_RXNE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(USART_MODULE_2) ], HAL_LL_UART_IRQ_RX );
        }
    }
    if( hal_ll_uart_get_status_flags( HAL_LL_USART2_BASE_ADDRESS , HAL_LL_UART_STATUS_TXE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_USART2_BASE_ADDRESS, HAL_LL_UART_IT_TXE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_USART2_BASE_ADDRESS, HAL_LL_UART_STATUS_TXE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(USART_MODULE_2) ], HAL_LL_UART_IRQ_TX );
        }
    }
    #endif
}
#endif

#if defined(USART_MODULE_3)
void MARK_AS_IRQ_HANDLER UART3_IRQHandler() MIKROC_IV(UART3_NVIC) {
    #ifdef USART_MODULE_3
    if( hal_ll_uart_get_status_flags( HAL_LL_USART3_BASE_ADDRESS , HAL_LL_UART_STATUS_RXNE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_USART3_BASE_ADDRESS, HAL_LL_UART_IT_RXNE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_USART3_BASE_ADDRESS, HAL_LL_UART_STATUS_RXNE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(USART_MODULE_3) ], HAL_LL_UART_IRQ_RX );
        }
    }
    if( hal_ll_uart_get_status_flags( HAL_LL_USART3_BASE_ADDRESS , HAL_LL_UART_STATUS_TXE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_USART3_BASE_ADDRESS, HAL_LL_UART_IT_TXE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_USART3_BASE_ADDRESS, HAL_LL_UART_STATUS_TXE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(USART_MODULE_3) ], HAL_LL_UART_IRQ_TX );
        }
    }
    #endif
}
#endif

#if defined(UART_MODULE_4)
void MARK_AS_IRQ_HANDLER UART4_IRQHandler() MIKROC_IV(UART4_NVIC) {
    #ifdef UART_MODULE_4
    if( hal_ll_uart_get_status_flags( HAL_LL_UART4_BASE_ADDRESS , HAL_LL_UART_STATUS_RXNE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_UART4_BASE_ADDRESS, HAL_LL_UART_IT_RXNE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_UART4_BASE_ADDRESS, HAL_LL_UART_STATUS_RXNE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(UART_MODULE_4) ], HAL_LL_UART_IRQ_RX );
        }
    }
    if( hal_ll_uart_get_status_flags( HAL_LL_UART4_BASE_ADDRESS , HAL_LL_UART_STATUS_TXE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_UART4_BASE_ADDRESS, HAL_LL_UART_IT_TXE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_UART4_BASE_ADDRESS, HAL_LL_UART_STATUS_TXE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(UART_MODULE_4) ], HAL_LL_UART_IRQ_TX );
        }
    }
    #endif
}
#endif

#if defined(UART_MODULE_5)
void MARK_AS_IRQ_HANDLER UART5_IRQHandler() MIKROC_IV(UART5_NVIC) {
    #ifdef UART_MODULE_5
    if( hal_ll_uart_get_status_flags( HAL_LL_UART5_BASE_ADDRESS , HAL_LL_UART_STATUS_RXNE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_UART5_BASE_ADDRESS, HAL_LL_UART_IT_RXNE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_UART5_BASE_ADDRESS, HAL_LL_UART_STATUS_RXNE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(UART_MODULE_5) ], HAL_LL_UART_IRQ_RX );
        }
    }
    if( hal_ll_uart_get_status_flags( HAL_LL_UART5_BASE_ADDRESS , HAL_LL_UART_STATUS_TXE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_UART5_BASE_ADDRESS, HAL_LL_UART_IT_TXE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_UART5_BASE_ADDRESS, HAL_LL_UART_STATUS_TXE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(UART_MODULE_5) ], HAL_LL_UART_IRQ_TX );
        }
    }
    #endif
}
#endif

