MikroElektronika/SDK-Build-Tool/sdk/targets/arm/mikroe/ai_generated/stm32/src/uart/implementations/doc_ds_91/hal_ll_uart.c
#if defined(LPUART_MODULE_1)
void MARK_AS_IRQ_HANDLER LPUART1_IRQHandler() MIKROC_IV(LPUART1_NVIC) {
    #ifdef LPUART_MODULE_1
    if( hal_ll_uart_get_status_flags( HAL_LL_LPUART1_BASE_ADDRESS , HAL_LL_UART_STATUS_RXNE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_LPUART1_BASE_ADDRESS, HAL_LL_UART_IT_RXNE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_LPUART1_BASE_ADDRESS, HAL_LL_UART_STATUS_RXNE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(LPUART_MODULE_1) ], HAL_LL_UART_IRQ_RX );
        }
    }
    if( hal_ll_uart_get_status_flags( HAL_LL_LPUART1_BASE_ADDRESS , HAL_LL_UART_STATUS_TXE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_LPUART1_BASE_ADDRESS, HAL_LL_UART_IT_TXE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_LPUART1_BASE_ADDRESS, HAL_LL_UART_STATUS_TXE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(LPUART_MODULE_1) ], HAL_LL_UART_IRQ_TX );
        }
    }
    #endif
}
#endif

#if defined(USART_MODULE_6)
void MARK_AS_IRQ_HANDLER UART6_IRQHandler() MIKROC_IV(UART6_NVIC) {
    #ifdef USART_MODULE_6
    if( hal_ll_uart_get_status_flags( HAL_LL_USART6_BASE_ADDRESS , HAL_LL_UART_STATUS_RXNE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_USART6_BASE_ADDRESS, HAL_LL_UART_IT_RXNE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_USART6_BASE_ADDRESS, HAL_LL_UART_STATUS_RXNE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(USART_MODULE_6) ], HAL_LL_UART_IRQ_RX );
        }
    }
    if( hal_ll_uart_get_status_flags( HAL_LL_USART6_BASE_ADDRESS , HAL_LL_UART_STATUS_TXE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_USART6_BASE_ADDRESS, HAL_LL_UART_IT_TXE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_USART6_BASE_ADDRESS, HAL_LL_UART_STATUS_TXE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(USART_MODULE_6) ], HAL_LL_UART_IRQ_TX );
        }
    }
    #endif
}
#endif

#if defined(USART1_MODULE_0)
void MARK_AS_IRQ_HANDLER UART10_IRQHandler() MIKROC_IV(UART10_NVIC) {
    #ifdef USART1_MODULE_0
    if( hal_ll_uart_get_status_flags( HAL_LL_USART0_BASE_ADDRESS , HAL_LL_UART_STATUS_RXNE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_USART0_BASE_ADDRESS, HAL_LL_UART_IT_RXNE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_USART0_BASE_ADDRESS, HAL_LL_UART_STATUS_RXNE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(USART_MODULE_0) ], HAL_LL_UART_IRQ_RX );
        }
    }
    if( hal_ll_uart_get_status_flags( HAL_LL_USART0_BASE_ADDRESS , HAL_LL_UART_STATUS_TXE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_USART0_BASE_ADDRESS, HAL_LL_UART_IT_TXE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_USART0_BASE_ADDRESS, HAL_LL_UART_STATUS_TXE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(USART_MODULE_0) ], HAL_LL_UART_IRQ_TX );
        }
    }
    #endif
}
#endif

#if defined(USART1_MODULE_1)
void MARK_AS_IRQ_HANDLER UART11_IRQHandler() MIKROC_IV(UART11_NVIC) {
    #ifdef USART1_MODULE_1
    if( hal_ll_uart_get_status_flags( HAL_LL_USART1_BASE_ADDRESS , HAL_LL_UART_STATUS_RXNE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_USART1_BASE_ADDRESS, HAL_LL_UART_IT_RXNE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_USART1_BASE_ADDRESS, HAL_LL_UART_STATUS_RXNE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(USART_MODULE_1) ], HAL_LL_UART_IRQ_RX );
        }
    }
    if( hal_ll_uart_get_status_flags( HAL_LL_USART1_BASE_ADDRESS , HAL_LL_UART_STATUS_TXE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_USART1_BASE_ADDRESS, HAL_LL_UART_IT_TXE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_USART1_BASE_ADDRESS, HAL_LL_UART_STATUS_TXE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(USART_MODULE_1) ], HAL_LL_UART_IRQ_TX );
        }
    }
    #endif
}
#endif

#if defined(UART_MODULE_7)
void MARK_AS_IRQ_HANDLER UART7_IRQHandler() MIKROC_IV(UART7_NVIC) {
    #ifdef UART_MODULE_7
    if( hal_ll_uart_get_status_flags( HAL_LL_UART7_BASE_ADDRESS , HAL_LL_UART_STATUS_RXNE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_UART7_BASE_ADDRESS, HAL_LL_UART_IT_RXNE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_UART7_BASE_ADDRESS, HAL_LL_UART_STATUS_RXNE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(UART_MODULE_7) ], HAL_LL_UART_IRQ_RX );
        }
    }
    if( hal_ll_uart_get_status_flags( HAL_LL_UART7_BASE_ADDRESS , HAL_LL_UART_STATUS_TXE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_UART7_BASE_ADDRESS, HAL_LL_UART_IT_TXE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_UART7_BASE_ADDRESS, HAL_LL_UART_STATUS_TXE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(UART_MODULE_7) ], HAL_LL_UART_IRQ_TX );
        }
    }
    #endif
}
#endif

#if defined(UART_MODULE_8)
void MARK_AS_IRQ_HANDLER UART8_IRQHandler() MIKROC_IV(UART8_NVIC) {
    #ifdef UART_MODULE_8
    if( hal_ll_uart_get_status_flags( HAL_LL_UART8_BASE_ADDRESS , HAL_LL_UART_STATUS_RXNE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_UART8_BASE_ADDRESS, HAL_LL_UART_IT_RXNE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_UART8_BASE_ADDRESS, HAL_LL_UART_STATUS_RXNE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(UART_MODULE_8) ], HAL_LL_UART_IRQ_RX );
        }
    }
    if( hal_ll_uart_get_status_flags( HAL_LL_UART8_BASE_ADDRESS , HAL_LL_UART_STATUS_TXE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_UART8_BASE_ADDRESS, HAL_LL_UART_IT_TXE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_UART8_BASE_ADDRESS, HAL_LL_UART_STATUS_TXE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(UART_MODULE_8) ], HAL_LL_UART_IRQ_TX );
        }
    }
    #endif
}
#endif

#if defined(UART_MODULE_9)
void MARK_AS_IRQ_HANDLER UART9_IRQHandler() MIKROC_IV(UART9_NVIC) {
    #ifdef UART_MODULE_9
    if( hal_ll_uart_get_status_flags( HAL_LL_UART9_BASE_ADDRESS , HAL_LL_UART_STATUS_RXNE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_UART9_BASE_ADDRESS, HAL_LL_UART_IT_RXNE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_UART9_BASE_ADDRESS, HAL_LL_UART_STATUS_RXNE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(UART_MODULE_9) ], HAL_LL_UART_IRQ_RX );
        }
    }
    if( hal_ll_uart_get_status_flags( HAL_LL_UART9_BASE_ADDRESS , HAL_LL_UART_STATUS_TXE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_UART9_BASE_ADDRESS, HAL_LL_UART_IT_TXE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_UART9_BASE_ADDRESS, HAL_LL_UART_STATUS_TXE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(UART_MODULE_9) ], HAL_LL_UART_IRQ_TX );
        }
    }
    #endif
}
#endif

#if defined(UART1_MODULE_2)
void MARK_AS_IRQ_HANDLER UART12_IRQHandler() MIKROC_IV(UART12_NVIC) {
    #ifdef UART1_MODULE_2
    if( hal_ll_uart_get_status_flags( HAL_LL_UART2_BASE_ADDRESS , HAL_LL_UART_STATUS_RXNE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_UART2_BASE_ADDRESS, HAL_LL_UART_IT_RXNE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_UART2_BASE_ADDRESS, HAL_LL_UART_STATUS_RXNE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(UART_MODULE_2) ], HAL_LL_UART_IRQ_RX );
        }
    }
    if( hal_ll_uart_get_status_flags( HAL_LL_UART2_BASE_ADDRESS , HAL_LL_UART_STATUS_TXE_FLAG ) ) {
        if( ( __HAL_LL_UART_GET_IT_SOURCE( HAL_LL_UART2_BASE_ADDRESS, HAL_LL_UART_IT_TXE ) ) != 0 ) {
            hal_ll_uart_clear_status_flag( HAL_LL_UART2_BASE_ADDRESS, HAL_LL_UART_STATUS_TXE_FLAG );
            irq_handler( objects[ hal_ll_uart_module_num(UART_MODULE_2) ], HAL_LL_UART_IRQ_TX );
        }
    }
    #endif
}
#endif

// ----------------------------------------------- PRIVATE FUNCTION DEFINITIONS
static uint8_t hal_ll_uart_find_index( handle_t *handle ) {
    hal_ll_uart_hw_specifics_map_local = hal_ll_get_specifics(hal_ll_uart_get_module_state_address);

    if( hal_ll_uart_hw_specifics_map_local->base != HAL_LL_MODULE_ERROR ) {
        return hal_ll_uart_hw_specifics_map_local->module_index;
    } else {
        return NULL;
    }
}

static hal_ll_pin_name_t hal_ll_uart_check_pins( hal_ll_pin_name_t tx_pin, hal_ll_pin_name_t rx_pin, hal_ll_uart_pin_id *index_list, hal_ll_uart_handle_register_t *handle_map ) {
    static const uint16_t tx_map_size = ( sizeof( hal_ll_uart_tx_map ) / sizeof( hal_ll_uart_pin_map_t ) );
    static const uint16_t rx_map_size = ( sizeof( hal_ll_uart_rx_map ) / sizeof( hal_ll_uart_pin_map_t ) );
    uint8_t hal_ll_module_id = 0;
    uint8_t index_counter = 0;
    uint16_t tx_index;
    uint16_t rx_index;

    if ( (HAL_LL_PIN_NC == tx_pin) || (HAL_LL_PIN_NC == rx_pin) ) {
        return HAL_LL_PIN_NC;
    }

