MikroElektronika/SDK-Build-Tool/sdk/targets/arm/mikroe/ai_generated/stm32/src/uart/implementations/doc_ds_91/hal_ll_uart.c
        hal_ll_gpio_module_struct_init( &module, hal_ll_state );
    }
}

static void hal_ll_uart_set_baud_bare_metal( hal_ll_uart_hw_specifics_map_t *map ) {
    uint32_t reg = 0;
    uint32_t integer_divider = 0;
    uint32_t fractional_divider = 0;
    hal_ll_uart_base_handle_t *hal_ll_hw_reg = hal_ll_uart_get_base_struct(map->base);
    uint32_t hal_ll_baud_value = hal_ll_uart_get_baud(hal_ll_uart_get_clock_speed(map->module_index),map->baud_rate.baud,4);
    uint32_t hal_ll_baud_real_value = hal_ll_uart_get_real_baud(hal_ll_uart_get_clock_speed(map->module_index),hal_ll_baud_value,4);

    // if error greater than specified, cancel setting baud rate
    if( (hal_ll_uart_get_baud_error(hal_ll_baud_real_value,map->baud_rate.baud)) > HAL_LL_UART_ACCEPTABLE_ERROR ) {
        map->baud_rate.real_baud = hal_ll_uart_get_baud_error(hal_ll_baud_real_value,map->baud_rate.baud);
    } else {
        map->baud_rate.real_baud = hal_ll_baud_real_value;

        integer_divider = ( ( 25 * hal_ll_uart_get_clock_speed( map->module_index ) ) / ( 4 * ( map->baud_rate.baud ) ) );
        reg = ( integer_divider / 100 ) << 4;

        fractional_divider = integer_divider - ( 100 * ( reg >> 4 ) );
        reg |= ( ( ( ( fractional_divider * 16 ) + 50 ) / 100 ) ) & 0x0F;

        hal_ll_hw_reg->brr = ( uint16_t )reg;
    }
}

static uint32_t hal_ll_uart_get_clock_speed( hal_ll_pin_name_t module_index ) {
    rcc_clocks_t rcc_clocks;

    RCC_GetClocksFrequency( &rcc_clocks );

    switch ( module_index )
    {
        #ifdef UART_MODULE_1
        case ( hal_ll_uart_module_num(UART_MODULE_1) ):
            return rcc_clocks.pclk2;
            break;
        #endif

        #ifdef UART_MODULE_2
        case ( hal_ll_uart_module_num(UART_MODULE_2) ):
            return rcc_clocks.pclk1;
            break;
        #endif

        #ifdef UART_MODULE_3
        case ( hal_ll_uart_module_num(UART_MODULE_3) ):
            return rcc_clocks.pclk1;
            break;
        #endif

        #ifdef UART_MODULE_4
        case ( hal_ll_uart_module_num(UART_MODULE_4) ):
            return rcc_clocks.pclk1;
            break;
        #endif

        #ifdef UART_MODULE_5
        case ( hal_ll_uart_module_num(UART_MODULE_5) ):
            return rcc_clocks.pclk1;
            break;
        #endif

        #ifdef UART_MODULE_6
        case ( hal_ll_uart_module_num(UART_MODULE_6) ):
            return rcc_clocks.pclk1;
            break;
        #endif

        #ifdef UART_MODULE_7
        case ( hal_ll_uart_module_num(UART_MODULE_7) ):
            return rcc_clocks.pclk1;
            break;
        #endif

        #ifdef UART_MODULE_8
        case ( hal_ll_uart_module_num(UART_MODULE_8) ):
            return rcc_clocks.pclk1;
            break;
        #endif

        #ifdef UART_MODULE_9
        case ( hal_ll_uart_module_num(UART_MODULE_9) ):
            return rcc_clocks.pclk1;
            break;
        #endif

        #ifdef UART_MODULE_10
        case ( hal_ll_uart_module_num(UART_MODULE_10) ):
            return rcc_clocks.pclk1;
            break;
        #endif

        #ifdef UART_MODULE_11
        case ( hal_ll_uart_module_num(UART_MODULE_11) ):
            return rcc_clocks.pclk1;
            break;
        #endif

        #ifdef UART_MODULE_12
        case ( hal_ll_uart_module_num(UART_MODULE_12) ):
            return rcc_clocks.pclk1;
            break;
        #endif


        default:
            break;
    }

    return NULL;
}

static void hal_ll_uart_set_stop_bits_bare_metal( hal_ll_uart_hw_specifics_map_t *map ) {
    hal_ll_uart_base_handle_t *hal_ll_hw_reg = hal_ll_uart_get_base_struct(map->base);

    switch ( map->stop_bit )
    {
        case HAL_LL_UART_STOP_BITS_HALF:
            hal_ll_hw_reg->cr2 |= STOP_BITS_HALF;
            break;
        case HAL_LL_UART_STOP_BITS_ONE:
            hal_ll_hw_reg->cr2 |= STOP_BITS_ONE;
            break;
        case HAL_LL_UART_STOP_BITS_ONE_AND_A_HALF:
            hal_ll_hw_reg->cr2 |= STOP_BITS_ONE_AND_A_HALF;
            break;
        case HAL_LL_UART_STOP_BITS_TWO:
            hal_ll_hw_reg->cr2 |= STOP_BITS_TWO;
            break;

        default:
            break;
    }
}

static void hal_ll_uart_set_data_bits_bare_metal( hal_ll_uart_hw_specifics_map_t *map ) {
    hal_ll_uart_base_handle_t *hal_ll_hw_reg = hal_ll_uart_get_base_struct(map->base);

    switch ( map->data_bit )
    {
        case HAL_LL_UART_DATA_BITS_7:
            hal_ll_hw_reg->cr1 |= DATA_BIT_7;
            break;

        case HAL_LL_UART_DATA_BITS_8:
            hal_ll_hw_reg->cr1 |= DATA_BIT_8;
            break;

        case HAL_LL_UART_DATA_BITS_9:
            hal_ll_hw_reg->cr1 |= DATA_BIT_9;
            break;


        default:
            break;
    }
}

static void hal_ll_uart_set_parity_bare_metal( hal_ll_uart_hw_specifics_map_t *map ) {
    hal_ll_uart_base_handle_t *hal_ll_hw_reg = hal_ll_uart_get_base_struct(map->base);

    switch ( map->parity )
    {
        case HAL_LL_UART_PARITY_NONE:
            hal_ll_hw_reg->cr1 |= PARITY_NO;
            break;
        case HAL_LL_UART_PARITY_EVEN:
            hal_ll_hw_reg->cr1 |= PARITY_ENABLED | PARITY_EVEN;
            break;
        case HAL_LL_UART_PARITY_ODD:
            hal_ll_hw_reg->cr1 |= PARITY_ENABLED | PARITY_ODD;
            break;

        default:
            break;
    }
}

static void hal_ll_uart_set_module( hal_ll_uart_base_handle_t *hal_ll_hw_reg, hal_ll_uart_state_t pin_state ) {
    switch ( pin_state )
    {
        case HAL_LL_UART_DISABLE:
            clear_reg_bit( &( hal_ll_hw_reg->cr1 ), HAL_LL_UART_CR1_UE );
            break;

        case HAL_LL_UART_ENABLE:
            set_reg_bit( &( hal_ll_hw_reg->cr1 ), HAL_LL_UART_CR1_UE );
            break;

        default:
            break;
    }
}

static void hal_ll_uart_set_transmitter( hal_ll_uart_base_handle_t *hal_ll_hw_reg, hal_ll_uart_state_t pin_state ) {
    switch ( pin_state )
    {
        case HAL_LL_UART_DISABLE:
            clear_reg_bit( &( hal_ll_hw_reg->cr1 ), HAL_LL_UART_CR1_TE );
            break;

        case HAL_LL_UART_ENABLE:
            set_reg_bit( &( hal_ll_hw_reg->cr1 ), HAL_LL_UART_CR1_TE );
            break;

        default:
            break;
    }
}

static void hal_ll_uart_set_receiver( hal_ll_uart_base_handle_t *hal_ll_hw_reg, hal_ll_uart_state_t pin_state ) {
    switch ( pin_state )
    {
        case HAL_LL_UART_DISABLE:
            clear_reg_bit( &( hal_ll_hw_reg->cr1 ), HAL_LL_UART_CR1_RE );
            break;

        case HAL_LL_UART_ENABLE:
            set_reg_bit( &( hal_ll_hw_reg->cr1 ), HAL_LL_UART_CR1_RE );
            break;

        default:
            break;
    }
}

static void hal_ll_uart_clear_regs( hal_ll_uart_base_handle_t *hal_ll_hw_reg ) {
    hal_ll_hw_reg->cr1 &= HAL_LL_UART_IT_CR1_MASK;
    hal_ll_hw_reg->cr2 &= HAL_LL_UART_IT_CR2_MASK;
    hal_ll_hw_reg->cr3 &= HAL_LL_UART_IT_CR3_MASK;
}

static void hal_ll_uart_hw_init( hal_ll_uart_hw_specifics_map_t *map ) {
    hal_ll_uart_clear_regs( map->base );

    hal_ll_uart_set_data_bits_bare_metal( map );

    hal_ll_uart_set_parity_bare_metal( map );

    hal_ll_uart_set_stop_bits_bare_metal( map );

    hal_ll_uart_set_baud_bare_metal( map );

    hal_ll_uart_set_transmitter( map->base, HAL_LL_UART_ENABLE );

    hal_ll_uart_set_receiver( map->base, HAL_LL_UART_ENABLE );

    hal_ll_uart_set_module( map->base, HAL_LL_UART_ENABLE );
}

static void hal_ll_uart_init( hal_ll_uart_hw_specifics_map_t *map ) {
    hal_ll_uart_set_clock( map, true );

    hal_ll_uart_alternate_functions_set_state( map, true );

    hal_ll_uart_hw_init( map );
}
// ------------------------------------------------------------------------- END

